Revit 2027 API
ConduitSizeIterator.Current Property
Gets the item at the current position of the iterator.
Namespace: Autodesk.Revit.DB.Electrical
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public virtual ConduitSize Current { get; }
Public Overridable ReadOnly Property Current As ConduitSize
	Get
public:
virtual property ConduitSize^ Current {
	ConduitSize^ get ();
}
abstract Current : ConduitSize with get
override Current : ConduitSize with get
Property Value
ConduitSize
Implements
IEnumerator<T>.Current
Exceptions
Exception | Condition
InvalidOperationException |  There is no current item in the iterator.
Remarks
There is no current item if the iterator has not started yet or has been done.
See Also
Reference
ConduitSizeIterator Class
Autodesk.Revit.DB.Electrical Namespace